upload_performance_result/metrics/sglang/20260721/test_npu_deepseek_r1_w4a8_8p_in3k5_out1k5_50ms.txt
memfabric_hybrid          1.0.8
sgl_kernel_npu            2026.6.1
sglang                    0.5.15.post2.dev596+g604b1507d /sgl-workspace/sglang/python
sglang-router             0.3.2
torch                     2.10.0+cpu
torch_npu                 2.10.0
torchao                   0.9.0
torchaudio                2.10.0+cpu
torchvision               0.25.0+cpu
CANN: 9.0.0
transformers: 5.12.1
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=20166, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/DeepSeek-R1-0528-w4a8-per-channel', served_model_name=None, tokenizer=None, num_prompts=896, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3500, random_output_len=1500, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=224, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:20166/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=20166, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/DeepSeek-R1-0528-w4a8-per-channel', served_model_name=None, tokenizer=None, num_prompts=896, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3500, random_output_len=1500, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=224, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 3136000
#Output tokens: 1344000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/896 [00:00<?, ?it/s]
  0%|          | 1/896 [01:24<21:03:25, 84.70s/it]
  0%|          | 2/896 [01:24<8:40:41, 34.95s/it] 
  0%|          | 3/896 [01:25<4:44:08, 19.09s/it]
  1%|          | 6/896 [01:25<1:36:14,  6.49s/it]
  1%|          | 9/896 [01:25<49:37,  3.36s/it]  
  1%|          | 11/896 [01:25<34:08,  2.31s/it]
  1%|▏         | 13/896 [01:25<23:43,  1.61s/it]
  2%|▏         | 15/896 [01:25<16:39,  1.13s/it]
  2%|▏         | 17/896 [01:25<11:50,  1.24it/s]
  2%|▏         | 19/896 [01:26<09:02,  1.62it/s]
  2%|▏         | 21/896 [01:26<07:55,  1.84it/s]
  2%|▏         | 22/896 [01:27<06:49,  2.14it/s]
  3%|▎         | 23/896 [01:27<05:46,  2.52it/s]
  3%|▎         | 24/896 [01:27<04:53,  2.97it/s]
  3%|▎         | 27/896 [01:27<03:22,  4.30it/s]
  3%|▎         | 28/896 [01:28<03:44,  3.86it/s]
  3%|▎         | 29/896 [01:28<04:48,  3.01it/s]
  3%|▎         | 30/896 [01:29<04:58,  2.90it/s]
  4%|▎         | 32/896 [01:29<04:42,  3.05it/s]
  4%|▎         | 33/896 [01:30<04:54,  2.93it/s]
  4%|▍         | 34/896 [01:30<04:34,  3.14it/s]
  4%|▍         | 35/896 [01:30<04:18,  3.33it/s]
  4%|▍         | 36/896 [01:30<04:06,  3.49it/s]
  4%|▍         | 37/896 [01:30<03:27,  4.13it/s]
  4%|▍         | 38/896 [01:31<03:22,  4.23it/s]
  4%|▍         | 39/896 [01:31<04:32,  3.14it/s]
  4%|▍         | 40/896 [01:31<04:14,  3.36it/s]
  5%|▍         | 41/896 [01:31<03:31,  4.05it/s]
  5%|▍         | 42/896 [01:32<03:00,  4.74it/s]
  5%|▍         | 43/896 [01:32<03:04,  4.62it/s]
  5%|▍         | 44/896 [01:32<03:15,  4.35it/s]
  5%|▌         | 47/896 [01:32<01:45,  8.03it/s]
  5%|▌         | 49/896 [01:32<01:43,  8.15it/s]
  6%|▌         | 50/896 [01:33<02:04,  6.81it/s]
  6%|▌         | 51/896 [01:33<02:46,  5.08it/s]
  6%|▌         | 52/896 [01:33<02:58,  4.73it/s]
  6%|▌         | 53/896 [01:34<03:29,  4.02it/s]
  6%|▌         | 54/896 [01:34<03:04,  4.56it/s]
  6%|▌         | 55/896 [01:37<13:05,  1.07it/s]
  6%|▋         | 56/896 [01:37<12:01,  1.17it/s]
  6%|▋         | 57/896 [01:37<09:02,  1.55it/s]
  6%|▋         | 58/896 [01:38<09:55,  1.41it/s]
  7%|▋         | 59/896 [01:39<07:57,  1.75it/s]
  7%|▋         | 60/896 [01:39<06:41,  2.08it/s]
  7%|▋         | 61/896 [01:39<07:10,  1.94it/s]
  7%|▋         | 62/896 [01:40<05:37,  2.47it/s]
  7%|▋         | 63/896 [01:40<04:27,  3.11it/s]
  7%|▋         | 64/896 [01:40<05:35,  2.48it/s]
  7%|▋         | 65/896 [01:40<04:32,  3.05it/s]
  7%|▋         | 66/896 [01:41<04:43,  2.93it/s]
  7%|▋         | 67/896 [01:41<05:19,  2.59it/s]
  8%|▊         | 68/896 [01:41<04:15,  3.24it/s]
  8%|▊         | 69/896 [01:42<04:26,  3.11it/s]
  8%|▊         | 71/896 [01:42<02:47,  4.93it/s]
  8%|▊         | 73/896 [01:45<09:52,  1.39it/s]
  8%|▊         | 74/896 [01:45<08:28,  1.62it/s]
  8%|▊         | 75/896 [01:45<07:12,  1.90it/s]
  9%|▊         | 78/896 [01:48<10:33,  1.29it/s]
  9%|▉         | 79/896 [01:49<08:50,  1.54it/s]
  9%|▉         | 82/896 [01:49<05:01,  2.70it/s]
  9%|▉         | 84/896 [01:49<04:32,  2.98it/s]
  9%|▉         | 85/896 [01:50<05:31,  2.45it/s]
 10%|▉         | 86/896 [01:50<04:43,  2.85it/s]
 10%|▉         | 87/896 [01:50<04:02,  3.34it/s]
 10%|▉         | 89/896 [01:51<03:44,  3.59it/s]
 10%|█         | 90/896 [01:51<04:00,  3.35it/s]
 10%|█         | 91/896 [01:51<03:47,  3.53it/s]
 10%|█         | 93/896 [01:51<02:34,  5.21it/s]
 11%|█         | 95/896 [01:52<02:34,  5.17it/s]
 11%|█         | 97/896 [01:52<01:55,  6.93it/s]
 11%|█▏        | 102/896 [01:52<01:03, 12.59it/s]
 12%|█▏        | 104/896 [01:52<00:59, 13.41it/s]
 12%|█▏        | 107/896 [01:52<00:50, 15.60it/s]
 13%|█▎        | 113/896 [01:55<03:29,  3.75it/s]
 13%|█▎        | 115/896 [02:00<09:17,  1.40it/s]
 13%|█▎        | 117/896 [02:01<07:36,  1.71it/s]
 13%|█▎        | 119/896 [02:01<06:01,  2.15it/s]
 14%|█▎        | 121/896 [02:01<04:54,  2.63it/s]
 14%|█▎        | 123/896 [02:01<04:24,  2.92it/s]
 14%|█▍        | 124/896 [02:02<03:56,  3.26it/s]
 14%|█▍        | 125/896 [02:02<03:30,  3.66it/s]
 14%|█▍        | 128/896 [02:02<02:10,  5.86it/s]
 15%|█▍        | 131/896 [02:02<01:44,  7.35it/s]
 15%|█▌        | 135/896 [02:02<01:11, 10.71it/s]
 15%|█▌        | 137/896 [02:03<01:26,  8.79it/s]
 16%|█▌        | 140/896 [02:03<01:07, 11.26it/s]
 16%|█▌        | 143/896 [02:05<04:30,  2.78it/s]
 16%|█▌        | 145/896 [02:08<07:08,  1.75it/s]
 16%|█▋        | 147/896 [02:08<05:31,  2.26it/s]
 17%|█▋        | 149/896 [02:08<04:17,  2.90it/s]
 17%|█▋        | 151/896 [02:09<03:31,  3.52it/s]
 17%|█▋        | 153/896 [02:09<02:57,  4.19it/s]
 17%|█▋        | 155/896 [02:12<07:24,  1.67it/s]
 17%|█▋        | 156/896 [02:12<06:58,  1.77it/s]
 18%|█▊        | 157/896 [02:12<06:12,  1.99it/s]
 18%|█▊        | 159/896 [02:13<04:13,  2.90it/s]
 18%|█▊        | 160/896 [02:13<04:01,  3.04it/s]
 18%|█▊        | 161/896 [02:13<04:05,  3.00it/s]
 18%|█▊        | 164/896 [02:13<02:20,  5.20it/s]
 19%|█▊        | 166/896 [02:14<02:03,  5.90it/s]
 19%|█▊        | 167/896 [02:14<01:58,  6.15it/s]
 19%|█▉        | 168/896 [02:14<01:49,  6.62it/s]
 19%|█▉        | 170/896 [02:14<01:26,  8.37it/s]
 19%|█▉        | 172/896 [02:14<01:27,  8.24it/s]
 19%|█▉        | 174/896 [02:14<01:13,  9.78it/s]
 20%|█▉        | 176/896 [02:14<01:04, 11.18it/s]
 20%|█▉        | 178/896 [02:18<06:37,  1.81it/s]
 20%|█▉        | 179/896 [02:18<05:40,  2.11it/s]
 20%|██        | 180/896 [02:21<12:33,  1.05s/it]
 20%|██        | 182/896 [02:21<08:06,  1.47it/s]
 20%|██        | 183/896 [02:21<07:00,  1.69it/s]
 21%|██        | 185/896 [02:22<04:54,  2.42it/s]
 21%|██        | 186/896 [02:24<11:20,  1.04it/s]
 21%|██        | 187/896 [02:25<09:01,  1.31it/s]
 21%|██        | 188/896 [02:25<07:07,  1.66it/s]
 21%|██        | 190/896 [02:25<04:29,  2.62it/s]
 21%|██▏       | 191/896 [02:25<05:04,  2.32it/s]
 21%|██▏       | 192/896 [02:26<04:09,  2.83it/s]
 22%|██▏       | 193/896 [02:26<04:33,  2.57it/s]
 22%|██▏       | 194/896 [02:26<04:04,  2.87it/s]
 22%|██▏       | 195/896 [02:27<06:08,  1.90it/s]
 22%|██▏       | 196/896 [02:28<05:11,  2.25it/s]
 22%|██▏       | 197/896 [02:28<05:20,  2.18it/s]
 22%|██▏       | 198/896 [02:29<05:26,  2.14it/s]
 22%|██▏       | 200/896 [02:32<11:03,  1.05it/s]
 22%|██▏       | 201/896 [02:32<09:43,  1.19it/s]
 23%|██▎       | 202/896 [02:34<12:41,  1.10s/it]
 23%|██▎       | 204/896 [02:36<11:28,  1.01it/s]
 23%|██▎       | 205/896 [02:37<12:01,  1.04s/it]
 23%|██▎       | 206/896 [02:37<09:44,  1.18it/s]
 23%|██▎       | 207/896 [02:43<23:40,  2.06s/it]
 23%|██▎       | 208/896 [02:47<32:03,  2.80s/it]
 23%|██▎       | 209/896 [03:00<1:04:04,  5.60s/it]
 23%|██▎       | 210/896 [03:05<1:01:17,  5.36s/it]
 24%|██▎       | 211/896 [03:05<45:01,  3.94s/it]  
 24%|██▍       | 213/896 [03:07<29:38,  2.60s/it]
 24%|██▍       | 214/896 [03:07<22:42,  2.00s/it]
 24%|██▍       | 215/896 [03:09<20:24,  1.80s/it]
 24%|██▍       | 216/896 [03:09<15:35,  1.38s/it]
 24%|██▍       | 217/896 [03:10<14:23,  1.27s/it]
 24%|██▍       | 218/896 [03:11<12:39,  1.12s/it]
 24%|██▍       | 219/896 [03:12<12:36,  1.12s/it]
 25%|██▍       | 220/896 [03:12<09:18,  1.21it/s]
 25%|██▍       | 221/896 [03:13<10:58,  1.03it/s]
 25%|██▍       | 222/896 [03:14<09:26,  1.19it/s]
 25%|██▍       | 223/896 [03:14<08:36,  1.30it/s]
 25%|██▌       | 226/896 [03:15<04:16,  2.61it/s]
 25%|██▌       | 228/896 [03:15<03:45,  2.96it/s]
 26%|██▌       | 229/896 [03:15<03:19,  3.35it/s]
 26%|██▌       | 230/896 [03:15<02:53,  3.84it/s]
 26%|██▌       | 232/896 [03:16<02:49,  3.92it/s]
 26%|██▌       | 233/896 [03:17<04:14,  2.60it/s]
 26%|██▌       | 234/896 [03:17<04:34,  2.41it/s]
 26%|██▌       | 235/896 [03:17<03:42,  2.97it/s]
 26%|██▋       | 237/896 [03:18<03:19,  3.30it/s]
 27%|██▋       | 238/896 [03:18<04:07,  2.66it/s]
 27%|██▋       | 239/896 [03:19<03:46,  2.91it/s]
 27%|██▋       | 240/896 [03:19<03:50,  2.85it/s]
 27%|██▋       | 242/896 [03:19<02:28,  4.40it/s]
 27%|██▋       | 243/896 [03:20<05:03,  2.15it/s]
 27%|██▋       | 244/896 [03:21<04:27,  2.44it/s]
 27%|██▋       | 245/896 [03:21<04:38,  2.34it/s]
 28%|██▊       | 247/896 [03:21<03:16,  3.31it/s]
 28%|██▊       | 249/896 [03:22<02:16,  4.74it/s]
 28%|██▊       | 250/896 [03:22<03:12,  3.36it/s]
 28%|██▊       | 252/896 [03:22<02:29,  4.31it/s]
 28%|██▊       | 254/896 [03:23<01:50,  5.78it/s]
 28%|██▊       | 255/896 [03:26<08:49,  1.21it/s]
 29%|██▊       | 256/896 [03:26<07:07,  1.50it/s]
 29%|██▊       | 257/896 [03:26<05:44,  1.86it/s]
 29%|██▉       | 258/896 [03:26<04:53,  2.17it/s]
 29%|██▉       | 260/896 [03:27<04:29,  2.36it/s]
 29%|██▉       | 261/896 [03:27<03:46,  2.80it/s]
 29%|██▉       | 262/896 [03:27<03:09,  3.35it/s]
 29%|██▉       | 263/896 [03:28<02:40,  3.95it/s]
 30%|██▉       | 265/896 [03:28<02:04,  5.05it/s]
 30%|██▉       | 266/896 [03:28<03:06,  3.37it/s]
 30%|██▉       | 267/896 [03:29<02:58,  3.52it/s]
 30%|██▉       | 268/896 [03:29<03:09,  3.31it/s]
 30%|███       | 269/896 [03:29<02:39,  3.94it/s]
 30%|███       | 272/896 [03:30<01:56,  5.36it/s]
 30%|███       | 273/896 [03:30<02:20,  4.43it/s]
 31%|███       | 275/896 [03:30<01:55,  5.39it/s]
 31%|███       | 277/896 [03:33<06:58,  1.48it/s]
 31%|███       | 278/896 [03:33<05:50,  1.76it/s]
 31%|███       | 279/896 [03:34<04:49,  2.13it/s]
 31%|███▏      | 280/896 [03:34<04:16,  2.40it/s]
 31%|███▏      | 282/896 [03:34<02:44,  3.73it/s]
 32%|███▏      | 283/896 [03:34<03:01,  3.37it/s]
 32%|███▏      | 284/896 [03:34<02:35,  3.92it/s]
 32%|███▏      | 285/896 [03:35<02:15,  4.52it/s]
 32%|███▏      | 288/896 [03:35<01:17,  7.88it/s]
 33%|███▎      | 292/896 [03:37<04:06,  2.45it/s]
 33%|███▎      | 295/896 [03:38<02:50,  3.53it/s]
 33%|███▎      | 297/896 [03:38<02:44,  3.64it/s]
 33%|███▎      | 298/896 [03:38<02:30,  3.98it/s]
 33%|███▎      | 299/896 [03:39<02:55,  3.39it/s]
 33%|███▎      | 300/896 [03:42<08:38,  1.15it/s]
 34%|███▎      | 301/896 [03:42<06:57,  1.43it/s]
 34%|███▍      | 303/896 [03:42<04:41,  2.10it/s]
 34%|███▍      | 304/896 [03:43<04:27,  2.21it/s]
 34%|███▍      | 305/896 [03:43<03:57,  2.48it/s]
 34%|███▍      | 306/896 [03:43<03:15,  3.01it/s]
 34%|███▍      | 307/896 [03:43<03:21,  2.93it/s]
 35%|███▍      | 311/896 [03:44<01:40,  5.84it/s]
 35%|███▍      | 313/896 [03:44<01:19,  7.32it/s]
 35%|███▌      | 315/896 [03:44<01:18,  7.37it/s]
 35%|███▌      | 317/896 [03:44<01:04,  9.01it/s]
 36%|███▌      | 319/896 [03:44<00:56, 10.14it/s]
 36%|███▌      | 321/896 [03:47<04:35,  2.09it/s]
 36%|███▌      | 323/896 [03:48<04:17,  2.22it/s]
 36%|███▌      | 324/896 [03:48<03:55,  2.43it/s]
 36%|███▋      | 326/896 [03:48<02:47,  3.40it/s]
 36%|███▋      | 327/896 [03:48<02:30,  3.78it/s]
 37%|███▋      | 328/896 [03:48<02:11,  4.32it/s]
 37%|███▋      | 329/896 [03:48<01:56,  4.85it/s]
 37%|███▋      | 330/896 [03:49<01:44,  5.40it/s]
 37%|███▋      | 332/896 [03:49<01:15,  7.52it/s]
 37%|███▋      | 334/896 [03:49<01:12,  7.79it/s]
 38%|███▊      | 336/896 [03:49<00:59,  9.35it/s]
 38%|███▊      | 338/896 [03:50<01:26,  6.46it/s]
 38%|███▊      | 339/896 [03:51<02:55,  3.17it/s]
 38%|███▊      | 340/896 [03:51<03:16,  2.83it/s]
 38%|███▊      | 342/896 [03:51<02:13,  4.14it/s]
 38%|███▊      | 344/896 [03:54<06:19,  1.45it/s]
 39%|███▊      | 346/896 [03:54<04:34,  2.00it/s]
 39%|███▊      | 347/896 [03:55<04:07,  2.21it/s]
 39%|███▉      | 348/896 [03:55<03:28,  2.62it/s]
 39%|███▉      | 349/896 [03:55<03:09,  2.88it/s]
 39%|███▉      | 350/896 [03:55<02:39,  3.43it/s]
 39%|███▉      | 351/896 [03:56<02:49,  3.22it/s]
 39%|███▉      | 352/896 [03:56<02:22,  3.80it/s]
 40%|███▉      | 354/896 [03:56<02:19,  3.89it/s]
 40%|███▉      | 355/896 [03:56<02:01,  4.44it/s]
 40%|███▉      | 356/896 [03:57<02:38,  3.40it/s]
 40%|████      | 359/896 [03:57<01:27,  6.17it/s]
 40%|████      | 361/896 [03:57<01:08,  7.84it/s]
 41%|████      | 363/896 [03:57<00:56,  9.45it/s]
 41%|████      | 365/896 [04:00<05:01,  1.76it/s]
 41%|████      | 367/896 [04:00<03:39,  2.41it/s]
 41%|████      | 369/896 [04:01<03:10,  2.77it/s]
 41%|████▏     | 370/896 [04:01<02:59,  2.93it/s]
 41%|████▏     | 371/896 [04:01<02:35,  3.37it/s]
 42%|████▏     | 372/896 [04:04<07:20,  1.19it/s]
 42%|████▏     | 374/896 [04:05<06:20,  1.37it/s]
 42%|████▏     | 375/896 [04:05<05:10,  1.68it/s]
 42%|████▏     | 376/896 [04:05<04:12,  2.06it/s]
 42%|████▏     | 377/896 [04:06<04:29,  1.93it/s]
 42%|████▏     | 378/896 [04:06<03:34,  2.41it/s]
 42%|████▏     | 379/896 [04:09<10:24,  1.21s/it]
 42%|████▏     | 380/896 [04:10<08:38,  1.01s/it]
 43%|████▎     | 381/896 [04:11<08:35,  1.00s/it]
 43%|████▎     | 382/896 [04:11<06:23,  1.34it/s]
 43%|████▎     | 383/896 [04:12<05:42,  1.50it/s]
 43%|████▎     | 384/896 [04:12<05:13,  1.63it/s]
 43%|████▎     | 385/896 [04:12<04:57,  1.72it/s]
 43%|████▎     | 386/896 [04:13<03:48,  2.23it/s]
 43%|████▎     | 387/896 [04:16<11:38,  1.37s/it]
 43%|████▎     | 388/896 [04:17<09:05,  1.07s/it]
 43%|████▎     | 389/896 [04:17<06:59,  1.21it/s]
 44%|████▎     | 390/896 [04:17<05:47,  1.46it/s]
 44%|████▎     | 391/896 [04:17<04:20,  1.94it/s]
 44%|████▍     | 392/896 [04:18<05:48,  1.45it/s]
 44%|████▍     | 394/896 [04:19<04:32,  1.84it/s]
 44%|████▍     | 395/896 [04:20<04:56,  1.69it/s]
 44%|████▍     | 396/896 [04:23<11:19,  1.36s/it]
 44%|████▍     | 398/896 [04:24<07:45,  1.07it/s]
 45%|████▍     | 399/896 [04:25<07:19,  1.13it/s]
 45%|████▍     | 400/896 [04:25<06:15,  1.32it/s]
 45%|████▍     | 401/896 [04:26<05:53,  1.40it/s]
 45%|████▍     | 403/896 [04:27<05:44,  1.43it/s]
 45%|████▌     | 404/896 [04:27<04:51,  1.69it/s]
 45%|████▌     | 405/896 [04:28<04:38,  1.77it/s]
 45%|████▌     | 406/896 [04:28<03:38,  2.24it/s]
 45%|████▌     | 407/896 [04:29<04:01,  2.02it/s]
 46%|████▌     | 408/896 [04:29<03:25,  2.38it/s]
 46%|████▌     | 409/896 [04:33<10:56,  1.35s/it]
 46%|████▌     | 410/896 [04:33<07:59,  1.01it/s]
 46%|████▌     | 411/896 [04:33<05:57,  1.36it/s]
 46%|████▌     | 412/896 [04:33<05:39,  1.43it/s]
 46%|████▌     | 413/896 [04:34<05:23,  1.49it/s]
 46%|████▌     | 414/896 [04:35<06:26,  1.25it/s]
 46%|████▋     | 415/896 [04:35<04:48,  1.67it/s]
 46%|████▋     | 416/896 [04:37<08:03,  1.01s/it]
 47%|████▋     | 417/896 [04:46<26:28,  3.32s/it]
 47%|████▋     | 418/896 [04:46<18:44,  2.35s/it]
 47%|████▋     | 419/896 [04:51<24:33,  3.09s/it]
 47%|████▋     | 420/896 [04:53<21:15,  2.68s/it]
 47%|████▋     | 421/896 [04:53<15:26,  1.95s/it]
 47%|████▋     | 422/896 [04:54<12:49,  1.62s/it]
 47%|████▋     | 423/896 [04:54<10:24,  1.32s/it]
 47%|████▋     | 424/896 [04:56<10:28,  1.33s/it]
 47%|████▋     | 425/896 [04:58<12:13,  1.56s/it]
 48%|████▊     | 426/896 [04:58<08:51,  1.13s/it]
 48%|████▊     | 427/896 [04:58<07:21,  1.06it/s]
 48%|████▊     | 428/896 [04:59<06:00,  1.30it/s]
 48%|████▊     | 429/896 [04:59<05:03,  1.54it/s]
 48%|████▊     | 430/896 [05:00<04:42,  1.65it/s]
 48%|████▊     | 431/896 [05:00<03:33,  2.18it/s]
 48%|████▊     | 432/896 [05:00<02:45,  2.80it/s]
 48%|████▊     | 433/896 [05:00<02:12,  3.49it/s]
 48%|████▊     | 434/896 [05:01<02:58,  2.59it/s]
 49%|████▊     | 435/896 [05:01<02:36,  2.94it/s]
 49%|████▊     | 436/896 [05:01<02:56,  2.61it/s]
 49%|████▉     | 437/896 [05:02<03:31,  2.17it/s]
 49%|████▉     | 438/896 [05:03<04:23,  1.74it/s]
 49%|████▉     | 439/896 [05:03<04:15,  1.79it/s]
 49%|████▉     | 441/896 [05:03<02:41,  2.82it/s]
 49%|████▉     | 442/896 [05:04<02:58,  2.54it/s]
 49%|████▉     | 443/896 [05:05<03:10,  2.37it/s]
 50%|████▉     | 444/896 [05:05<02:49,  2.67it/s]
 50%|████▉     | 445/896 [05:05<02:17,  3.29it/s]
 50%|████▉     | 446/896 [05:05<02:25,  3.09it/s]
 50%|█████     | 448/896 [05:05<01:44,  4.28it/s]
 50%|█████     | 450/896 [05:06<01:13,  6.09it/s]
 50%|█████     | 452/896 [05:06<00:57,  7.69it/s]
 51%|█████     | 454/896 [05:06<00:56,  7.82it/s]
 51%|█████     | 455/896 [05:07<01:59,  3.68it/s]
 51%|█████     | 457/896 [05:10<05:20,  1.37it/s]
 51%|█████     | 459/896 [05:10<03:39,  1.99it/s]
 51%|█████▏    | 460/896 [05:10<03:19,  2.18it/s]
 51%|█████▏    | 461/896 [05:11<02:59,  2.43it/s]
 52%|█████▏    | 462/896 [05:11<02:29,  2.91it/s]
 52%|█████▏    | 463/896 [05:11<02:31,  2.86it/s]
 52%|█████▏    | 464/896 [05:12<04:26,  1.62it/s]
 52%|█████▏    | 465/896 [05:13<03:26,  2.09it/s]
 52%|█████▏    | 468/896 [05:13<01:43,  4.14it/s]
 52%|█████▏    | 470/896 [05:13<01:35,  4.45it/s]
 53%|█████▎    | 472/896 [05:13<01:12,  5.83it/s]
 53%|█████▎    | 474/896 [05:16<04:10,  1.68it/s]
 53%|█████▎    | 476/896 [05:16<03:09,  2.21it/s]
 53%|█████▎    | 477/896 [05:17<02:42,  2.57it/s]
 53%|█████▎    | 478/896 [05:17<02:21,  2.96it/s]
 53%|█████▎    | 479/896 [05:17<02:00,  3.47it/s]
 54%|█████▎    | 480/896 [05:17<01:54,  3.63it/s]
 54%|█████▎    | 481/896 [05:17<01:39,  4.19it/s]
 54%|█████▍    | 483/896 [05:18<02:12,  3.12it/s]
 54%|█████▍    | 484/896 [05:18<01:53,  3.64it/s]
 54%|█████▍    | 488/896 [05:18<01:01,  6.66it/s]
 55%|█████▍    | 489/896 [05:19<01:17,  5.26it/s]
 55%|█████▍    | 490/896 [05:19<01:11,  5.64it/s]
 55%|█████▍    | 491/896 [05:19<01:39,  4.05it/s]
 55%|█████▌    | 493/896 [05:20<01:38,  4.08it/s]
 55%|█████▌    | 497/896 [05:20<00:53,  7.44it/s]
 56%|█████▌    | 499/896 [05:23<03:08,  2.10it/s]
 56%|█████▌    | 500/896 [05:23<02:54,  2.26it/s]
 56%|█████▌    | 501/896 [05:23<02:39,  2.47it/s]
 56%|█████▋    | 504/896 [05:24<02:06,  3.10it/s]
 57%|█████▋    | 507/896 [05:24<01:21,  4.76it/s]
 57%|█████▋    | 512/896 [05:27<02:28,  2.59it/s]
 57%|█████▋    | 513/896 [05:27<02:22,  2.69it/s]
 57%|█████▋    | 514/896 [05:27<02:14,  2.83it/s]
 57%|█████▋    | 515/896 [05:28<01:59,  3.19it/s]
 58%|█████▊    | 516/896 [05:28<01:44,  3.65it/s]
 58%|█████▊    | 517/896 [05:28<01:31,  4.16it/s]
 58%|█████▊    | 518/896 [05:28<01:31,  4.13it/s]
 58%|█████▊    | 519/896 [05:28<01:32,  4.09it/s]
 58%|█████▊    | 520/896 [05:28<01:19,  4.75it/s]
 58%|█████▊    | 521/896 [05:29<01:10,  5.31it/s]
 58%|█████▊    | 522/896 [05:32<06:13,  1.00it/s]
 58%|█████▊    | 523/896 [05:32<04:52,  1.28it/s]
 58%|█████▊    | 524/896 [05:32<03:40,  1.69it/s]
 59%|█████▊    | 526/896 [05:32<02:08,  2.89it/s]
 59%|█████▉    | 528/896 [05:32<01:27,  4.21it/s]
 59%|█████▉    | 530/896 [05:36<04:57,  1.23it/s]
 59%|█████▉    | 532/896 [05:36<03:24,  1.78it/s]
 59%|█████▉    | 533/896 [05:36<03:10,  1.91it/s]
 60%|█████▉    | 534/896 [05:37<02:37,  2.30it/s]
 60%|█████▉    | 535/896 [05:37<02:10,  2.76it/s]
 60%|█████▉    | 536/896 [05:37<01:47,  3.34it/s]
 60%|█████▉    | 537/896 [05:38<02:29,  2.40it/s]
 60%|██████    | 538/896 [05:38<02:48,  2.12it/s]
 60%|██████    | 539/896 [05:39<02:38,  2.25it/s]
 60%|██████    | 540/896 [05:39<02:17,  2.59it/s]
 60%|██████    | 541/896 [05:40<02:53,  2.04it/s]
 61%|██████    | 543/896 [05:40<01:53,  3.12it/s]
 61%|██████    | 544/896 [05:40<01:57,  2.99it/s]
 61%|██████    | 545/896 [05:40<01:49,  3.21it/s]
 61%|██████    | 546/896 [05:41<01:31,  3.85it/s]
 61%|██████    | 547/896 [05:41<01:16,  4.55it/s]
 61%|██████▏   | 549/896 [05:41<00:51,  6.77it/s]
 61%|██████▏   | 550/896 [05:41<00:50,  6.85it/s]
 61%|██████▏   | 551/896 [05:41<00:48,  7.10it/s]
 62%|██████▏   | 552/896 [05:46<07:35,  1.32s/it]
 62%|██████▏   | 553/896 [05:46<05:40,  1.01it/s]
 62%|██████▏   | 554/896 [05:46<04:16,  1.33it/s]
 62%|██████▏   | 555/896 [05:46<03:26,  1.65it/s]
 62%|██████▏   | 557/896 [05:47<02:29,  2.27it/s]
 62%|██████▏   | 558/896 [05:47<02:03,  2.73it/s]
 62%|██████▏   | 559/896 [05:47<01:41,  3.33it/s]
 62%|██████▎   | 560/896 [05:47<01:58,  2.84it/s]
 63%|██████▎   | 561/896 [05:47<01:36,  3.46it/s]
 63%|██████▎   | 562/896 [05:48<01:42,  3.26it/s]
 63%|██████▎   | 563/896 [05:48<01:36,  3.45it/s]
 63%|██████▎   | 564/896 [05:48<01:20,  4.12it/s]
 63%|██████▎   | 565/896 [05:48<01:21,  4.07it/s]
 63%|██████▎   | 567/896 [05:49<01:02,  5.26it/s]
 64%|██████▎   | 569/896 [05:49<00:44,  7.37it/s]
 64%|██████▎   | 571/896 [05:49<00:42,  7.61it/s]
 64%|██████▍   | 573/896 [05:49<00:49,  6.58it/s]
 64%|██████▍   | 574/896 [05:50<00:54,  5.86it/s]
 64%|██████▍   | 575/896 [05:50<00:59,  5.44it/s]
 65%|██████▍   | 578/896 [05:50<00:43,  7.29it/s]
 65%|██████▍   | 579/896 [05:50<00:57,  5.53it/s]
 65%|██████▍   | 580/896 [05:51<01:25,  3.70it/s]
 65%|██████▍   | 582/896 [05:52<01:30,  3.48it/s]
 65%|██████▌   | 583/896 [05:52<01:18,  3.98it/s]
 65%|██████▌   | 584/896 [05:52<01:09,  4.52it/s]
 65%|██████▌   | 585/896 [05:53<01:39,  3.11it/s]
 65%|██████▌   | 586/896 [05:53<01:23,  3.71it/s]
 66%|██████▌   | 587/896 [05:53<01:51,  2.77it/s]
 66%|██████▌   | 588/896 [05:54<01:53,  2.70it/s]
 66%|██████▌   | 589/896 [05:57<05:59,  1.17s/it]
 66%|██████▌   | 590/896 [05:58<05:09,  1.01s/it]
 66%|██████▌   | 592/896 [05:58<03:48,  1.33it/s]
 66%|██████▌   | 593/896 [05:58<02:59,  1.69it/s]
 66%|██████▋   | 595/896 [05:59<02:01,  2.48it/s]
 67%|██████▋   | 596/896 [06:00<02:32,  1.97it/s]
 67%|██████▋   | 597/896 [06:00<02:22,  2.10it/s]
 67%|██████▋   | 598/896 [06:03<05:24,  1.09s/it]
 67%|██████▋   | 600/896 [06:04<04:23,  1.12it/s]
 67%|██████▋   | 601/896 [06:04<03:38,  1.35it/s]
 67%|██████▋   | 602/896 [06:08<07:13,  1.47s/it]
 67%|██████▋   | 604/896 [06:09<04:56,  1.02s/it]
 68%|██████▊   | 605/896 [06:12<07:56,  1.64s/it]
 68%|██████▊   | 606/896 [06:14<07:33,  1.56s/it]
 68%|██████▊   | 607/896 [06:14<06:12,  1.29s/it]
 68%|██████▊   | 608/896 [06:16<06:16,  1.31s/it]
 68%|██████▊   | 610/896 [06:16<03:38,  1.31it/s]
 68%|██████▊   | 611/896 [06:19<06:21,  1.34s/it]
 68%|██████▊   | 612/896 [06:20<06:12,  1.31s/it]
 68%|██████▊   | 613/896 [06:20<04:41,  1.00it/s]
 69%|██████▊   | 614/896 [06:21<04:01,  1.17it/s]
 69%|██████▊   | 615/896 [06:21<03:21,  1.40it/s]
 69%|██████▉   | 616/896 [06:22<02:52,  1.62it/s]
 69%|██████▉   | 617/896 [06:22<02:32,  1.83it/s]
 69%|██████▉   | 618/896 [06:22<01:57,  2.37it/s]
 69%|██████▉   | 619/896 [06:23<03:03,  1.51it/s]
 69%|██████▉   | 620/896 [06:27<06:33,  1.43s/it]
 69%|██████▉   | 621/896 [06:28<06:46,  1.48s/it]
 69%|██████▉   | 622/896 [06:28<04:53,  1.07s/it]
 70%|██████▉   | 623/896 [06:30<05:25,  1.19s/it]
 70%|██████▉   | 625/896 [06:30<03:24,  1.33it/s]
 70%|██████▉   | 627/896 [06:31<02:21,  1.90it/s]
 70%|███████   | 628/896 [06:31<02:12,  2.02it/s]
 70%|███████   | 629/896 [06:31<02:04,  2.15it/s]
 70%|███████   | 631/896 [06:32<01:26,  3.07it/s]
 71%|███████   | 632/896 [06:34<03:40,  1.20it/s]
 71%|███████   | 633/896 [06:35<03:57,  1.11it/s]
 71%|███████   | 634/896 [06:36<03:37,  1.21it/s]
 71%|███████   | 635/896 [06:36<02:45,  1.58it/s]
 71%|███████   | 636/896 [06:36<02:09,  2.01it/s]
 71%|███████   | 637/896 [06:39<05:32,  1.28s/it]
 71%|███████   | 638/896 [06:40<04:23,  1.02s/it]
 71%|███████▏  | 639/896 [06:40<03:33,  1.21it/s]
 71%|███████▏  | 640/896 [06:40<02:57,  1.44it/s]
 72%|███████▏  | 641/896 [06:41<02:22,  1.79it/s]
 72%|███████▏  | 642/896 [06:42<02:54,  1.45it/s]
 72%|███████▏  | 644/896 [06:42<01:40,  2.50it/s]
 72%|███████▏  | 645/896 [06:42<01:53,  2.20it/s]
 72%|███████▏  | 649/896 [06:43<01:08,  3.60it/s]
 73%|███████▎  | 650/896 [06:44<01:48,  2.27it/s]
 73%|███████▎  | 651/896 [06:45<01:39,  2.46it/s]
 73%|███████▎  | 653/896 [06:45<01:24,  2.87it/s]
 73%|███████▎  | 654/896 [06:46<01:37,  2.48it/s]
 73%|███████▎  | 655/896 [06:46<01:28,  2.72it/s]
 73%|███████▎  | 656/896 [06:46<01:14,  3.24it/s]
 73%|███████▎  | 658/896 [06:46<00:49,  4.85it/s]
 74%|███████▎  | 660/896 [06:48<01:57,  2.01it/s]
 74%|███████▍  | 661/896 [06:48<01:38,  2.39it/s]
 74%|███████▍  | 662/896 [06:49<01:34,  2.48it/s]
 74%|███████▍  | 664/896 [06:49<01:02,  3.69it/s]
 74%|███████▍  | 665/896 [06:52<03:08,  1.22it/s]
 74%|███████▍  | 666/896 [06:52<02:44,  1.40it/s]
 74%|███████▍  | 667/896 [06:52<02:09,  1.77it/s]
 75%|███████▍  | 668/896 [06:53<02:11,  1.74it/s]
 75%|███████▍  | 669/896 [06:53<01:57,  1.94it/s]
 75%|███████▍  | 670/896 [06:53<01:32,  2.44it/s]
 75%|███████▍  | 671/896 [06:53<01:21,  2.78it/s]
 75%|███████▌  | 672/896 [06:54<01:14,  3.03it/s]
 75%|███████▌  | 673/896 [06:54<01:24,  2.65it/s]
 75%|███████▌  | 674/896 [06:55<02:02,  1.81it/s]
 75%|███████▌  | 675/896 [06:55<01:35,  2.32it/s]
 75%|███████▌  | 676/896 [06:56<01:38,  2.23it/s]
 76%|███████▌  | 677/896 [06:56<01:24,  2.59it/s]
 76%|███████▌  | 678/896 [06:57<01:38,  2.21it/s]
 76%|███████▌  | 679/896 [06:57<01:18,  2.78it/s]
 76%|███████▌  | 680/896 [06:57<01:10,  3.07it/s]
 76%|███████▌  | 681/896 [06:57<01:12,  2.95it/s]
 76%|███████▌  | 683/896 [07:01<03:20,  1.06it/s]
 76%|███████▋  | 684/896 [07:01<03:09,  1.12it/s]
 76%|███████▋  | 685/896 [07:01<02:26,  1.44it/s]
 77%|███████▋  | 686/896 [07:02<01:52,  1.86it/s]
 77%|███████▋  | 688/896 [07:02<01:19,  2.60it/s]
 77%|███████▋  | 690/896 [07:02<00:57,  3.57it/s]
 77%|███████▋  | 691/896 [07:02<00:51,  4.01it/s]
 77%|███████▋  | 692/896 [07:02<00:45,  4.52it/s]
 77%|███████▋  | 693/896 [07:03<00:39,  5.14it/s]
 77%|███████▋  | 694/896 [07:03<00:35,  5.63it/s]
 78%|███████▊  | 695/896 [07:03<00:53,  3.78it/s]
 78%|███████▊  | 696/896 [07:04<01:06,  3.03it/s]
 78%|███████▊  | 697/896 [07:04<01:00,  3.28it/s]
 78%|███████▊  | 698/896 [07:04<00:50,  3.93it/s]
 78%|███████▊  | 699/896 [07:05<01:03,  3.11it/s]
 78%|███████▊  | 700/896 [07:05<01:06,  2.93it/s]
 78%|███████▊  | 702/896 [07:06<01:08,  2.85it/s]
 78%|███████▊  | 703/896 [07:06<01:26,  2.23it/s]
 79%|███████▊  | 704/896 [07:07<01:10,  2.73it/s]
 79%|███████▉  | 706/896 [07:07<00:45,  4.19it/s]
 79%|███████▉  | 707/896 [07:10<03:02,  1.04it/s]
 79%|███████▉  | 708/896 [07:13<04:29,  1.43s/it]
 79%|███████▉  | 709/896 [07:14<03:55,  1.26s/it]
 79%|███████▉  | 710/896 [07:14<03:02,  1.02it/s]
 79%|███████▉  | 711/896 [07:14<02:29,  1.24it/s]
 79%|███████▉  | 712/896 [07:14<01:51,  1.65it/s]
 80%|███████▉  | 715/896 [07:15<00:58,  3.11it/s]
 80%|███████▉  | 716/896 [07:15<00:54,  3.31it/s]
 80%|████████  | 719/896 [07:15<00:32,  5.50it/s]
 80%|████████  | 721/896 [07:16<00:38,  4.51it/s]
 81%|████████  | 722/896 [07:16<00:50,  3.41it/s]
 81%|████████  | 723/896 [07:17<01:06,  2.60it/s]
 81%|████████  | 724/896 [07:17<00:55,  3.08it/s]
 81%|████████  | 725/896 [07:18<01:01,  2.76it/s]
 81%|████████  | 726/896 [07:18<00:57,  2.97it/s]
 81%|████████  | 727/896 [07:18<00:52,  3.20it/s]
 81%|████████▏ | 728/896 [07:18<00:43,  3.86it/s]
 81%|████████▏ | 730/896 [07:18<00:28,  5.83it/s]
 82%|████████▏ | 731/896 [07:18<00:26,  6.35it/s]
 82%|████████▏ | 733/896 [07:19<00:23,  6.87it/s]
 82%|████████▏ | 734/896 [07:19<00:35,  4.51it/s]
 82%|████████▏ | 736/896 [07:19<00:29,  5.43it/s]
 82%|████████▏ | 737/896 [07:20<00:44,  3.56it/s]
 82%|████████▏ | 738/896 [07:20<00:42,  3.73it/s]
 82%|████████▏ | 739/896 [07:20<00:36,  4.29it/s]
 83%|████████▎ | 740/896 [07:21<00:45,  3.42it/s]
 83%|████████▎ | 741/896 [07:21<00:38,  4.03it/s]
 83%|████████▎ | 742/896 [07:22<01:08,  2.26it/s]
 83%|████████▎ | 744/896 [07:22<00:41,  3.67it/s]
 83%|████████▎ | 745/896 [07:22<00:43,  3.44it/s]
 83%|████████▎ | 746/896 [07:23<01:03,  2.35it/s]
 83%|████████▎ | 747/896 [07:25<02:02,  1.21it/s]
 83%|████████▎ | 748/896 [07:25<01:33,  1.59it/s]
 84%|████████▎ | 749/896 [07:26<01:25,  1.71it/s]
 84%|████████▎ | 750/896 [07:26<01:05,  2.22it/s]
 84%|████████▍ | 752/896 [07:26<00:51,  2.82it/s]
 84%|████████▍ | 753/896 [07:27<00:50,  2.82it/s]
 84%|████████▍ | 754/896 [07:27<00:59,  2.40it/s]
 84%|████████▍ | 755/896 [07:27<00:47,  2.99it/s]
 84%|████████▍ | 757/896 [07:28<00:37,  3.75it/s]
 85%|████████▍ | 758/896 [07:28<00:51,  2.69it/s]
 85%|████████▍ | 759/896 [07:29<00:45,  2.99it/s]
 85%|████████▍ | 760/896 [07:29<00:46,  2.93it/s]
 85%|████████▍ | 761/896 [07:29<00:42,  3.18it/s]
 85%|████████▌ | 762/896 [07:31<01:19,  1.69it/s]
 85%|████████▌ | 763/896 [07:31<01:00,  2.21it/s]
 85%|████████▌ | 764/896 [07:31<00:56,  2.34it/s]
 85%|████████▌ | 766/896 [07:31<00:37,  3.47it/s]
 86%|████████▌ | 767/896 [07:31<00:31,  4.05it/s]
 86%|████████▌ | 768/896 [07:32<00:54,  2.34it/s]
 86%|████████▌ | 770/896 [07:33<00:43,  2.87it/s]
 86%|████████▌ | 771/896 [07:33<00:50,  2.47it/s]
 86%|████████▌ | 772/896 [07:34<00:41,  3.02it/s]
 86%|████████▋ | 773/896 [07:34<00:41,  2.95it/s]
 86%|████████▋ | 774/896 [07:34<00:34,  3.54it/s]
 86%|████████▋ | 775/896 [07:34<00:32,  3.74it/s]
 87%|████████▋ | 777/896 [07:35<00:24,  4.91it/s]
 87%|████████▋ | 778/896 [07:35<00:28,  4.15it/s]
 87%|████████▋ | 779/896 [07:36<00:42,  2.76it/s]
 87%|████████▋ | 780/896 [07:36<00:34,  3.35it/s]
 87%|████████▋ | 781/896 [07:36<00:28,  4.07it/s]
 87%|████████▋ | 782/896 [07:36<00:24,  4.69it/s]
 88%|████████▊ | 784/896 [07:36<00:19,  5.80it/s]
 88%|████████▊ | 785/896 [07:37<00:27,  4.05it/s]
 88%|████████▊ | 786/896 [07:37<00:37,  2.96it/s]
 88%|████████▊ | 787/896 [07:38<00:41,  2.66it/s]
 88%|████████▊ | 788/896 [07:38<00:32,  3.27it/s]
 88%|████████▊ | 790/896 [07:38<00:20,  5.08it/s]
 88%|████████▊ | 792/896 [07:38<00:19,  5.25it/s]
 89%|████████▊ | 793/896 [07:39<00:25,  3.98it/s]
 89%|████████▊ | 794/896 [07:39<00:33,  3.09it/s]
 89%|████████▉ | 796/896 [07:40<00:23,  4.23it/s]
 89%|████████▉ | 797/896 [07:40<00:25,  3.92it/s]
 89%|████████▉ | 798/896 [07:41<00:34,  2.86it/s]
 89%|████████▉ | 799/896 [07:41<00:32,  2.95it/s]
 89%|████████▉ | 800/896 [07:41<00:37,  2.55it/s]
 90%|████████▉ | 802/896 [07:42<00:23,  4.07it/s]
 90%|████████▉ | 803/896 [07:42<00:24,  3.76it/s]
 90%|████████▉ | 804/896 [07:42<00:23,  3.98it/s]
 90%|████████▉ | 806/896 [07:42<00:15,  5.90it/s]
 90%|█████████ | 807/896 [07:42<00:16,  5.56it/s]
 90%|█████████ | 808/896 [07:42<00:14,  6.20it/s]
 90%|█████████ | 810/896 [07:43<00:10,  8.57it/s]
 91%|█████████ | 812/896 [07:43<00:14,  5.80it/s]
 91%|█████████ | 813/896 [07:44<00:26,  3.18it/s]
 91%|█████████ | 814/896 [07:45<00:34,  2.40it/s]
 91%|█████████ | 815/896 [07:45<00:29,  2.72it/s]
 91%|█████████ | 817/896 [07:45<00:20,  3.86it/s]
 91%|█████████▏| 818/896 [07:45<00:19,  4.02it/s]
 91%|█████████▏| 819/896 [07:46<00:18,  4.17it/s]
 92%|█████████▏| 820/896 [07:47<00:38,  1.98it/s]
 92%|█████████▏| 821/896 [07:47<00:36,  2.07it/s]
 92%|█████████▏| 822/896 [07:48<00:45,  1.62it/s]
 92%|█████████▏| 823/896 [07:49<00:38,  1.87it/s]
 92%|█████████▏| 824/896 [07:49<00:33,  2.12it/s]
 92%|█████████▏| 825/896 [07:49<00:32,  2.18it/s]
 92%|█████████▏| 826/896 [07:49<00:24,  2.81it/s]
 92%|█████████▏| 827/896 [07:50<00:21,  3.19it/s]
 92%|█████████▏| 828/896 [07:50<00:23,  2.89it/s]
 93%|█████████▎| 829/896 [07:50<00:24,  2.69it/s]
 93%|█████████▎| 831/896 [07:51<00:16,  3.99it/s]
 93%|█████████▎| 832/896 [07:51<00:17,  3.76it/s]
 93%|█████████▎| 833/896 [07:51<00:16,  3.92it/s]
 93%|█████████▎| 834/896 [07:52<00:18,  3.31it/s]
 93%|█████████▎| 835/896 [07:53<00:27,  2.19it/s]
 93%|█████████▎| 837/896 [07:54<00:34,  1.70it/s]
 94%|█████████▎| 839/896 [07:54<00:23,  2.48it/s]
 94%|█████████▍| 840/896 [07:56<00:36,  1.55it/s]
 94%|█████████▍| 841/896 [07:56<00:31,  1.75it/s]
 94%|█████████▍| 842/896 [07:56<00:27,  1.96it/s]
 94%|█████████▍| 843/896 [07:57<00:28,  1.83it/s]
 94%|█████████▍| 845/896 [07:58<00:22,  2.30it/s]
 94%|█████████▍| 846/896 [07:58<00:22,  2.26it/s]
 95%|█████████▍| 847/896 [07:59<00:24,  2.02it/s]
 95%|█████████▍| 848/896 [07:59<00:19,  2.42it/s]
 95%|█████████▍| 849/896 [07:59<00:16,  2.85it/s]
 95%|█████████▍| 851/896 [08:00<00:15,  2.94it/s]
 95%|█████████▌| 853/896 [08:00<00:11,  3.82it/s]
 95%|█████████▌| 854/896 [08:00<00:11,  3.76it/s]
 95%|█████████▌| 855/896 [08:01<00:11,  3.70it/s]
 96%|█████████▌| 857/896 [08:01<00:11,  3.41it/s]
 96%|█████████▌| 858/896 [08:01<00:10,  3.74it/s]
 96%|█████████▌| 859/896 [08:02<00:14,  2.61it/s]
 96%|█████████▌| 860/896 [08:02<00:11,  3.01it/s]
 96%|█████████▌| 861/896 [08:03<00:14,  2.40it/s]
 96%|█████████▌| 862/896 [08:04<00:16,  2.08it/s]
 96%|█████████▋| 863/896 [08:04<00:16,  2.00it/s]
 96%|█████████▋| 864/896 [08:05<00:13,  2.29it/s]
 97%|█████████▋| 865/896 [08:05<00:15,  2.00it/s]
 97%|█████████▋| 866/896 [08:05<00:12,  2.46it/s]
 97%|█████████▋| 867/896 [08:06<00:09,  2.93it/s]
 97%|█████████▋| 869/896 [08:06<00:07,  3.43it/s]
 97%|█████████▋| 870/896 [08:07<00:09,  2.79it/s]
 97%|█████████▋| 872/896 [08:07<00:09,  2.49it/s]
 98%|█████████▊| 874/896 [08:08<00:08,  2.45it/s]
 98%|█████████▊| 875/896 [08:09<00:10,  2.09it/s]
 98%|█████████▊| 877/896 [08:10<00:07,  2.48it/s]
 98%|█████████▊| 878/896 [08:10<00:07,  2.40it/s]
 98%|█████████▊| 879/896 [08:11<00:07,  2.23it/s]
 98%|█████████▊| 880/896 [08:11<00:06,  2.61it/s]
 98%|█████████▊| 882/896 [08:11<00:03,  3.80it/s]
 99%|█████████▊| 884/896 [08:12<00:03,  3.16it/s]
 99%|█████████▉| 885/896 [08:12<00:03,  3.05it/s]
 99%|█████████▉| 888/896 [08:13<00:01,  4.37it/s]
 99%|█████████▉| 889/896 [08:13<00:01,  4.23it/s]
 99%|█████████▉| 890/896 [08:13<00:01,  4.47it/s]
 99%|█████████▉| 891/896 [08:14<00:01,  3.41it/s]
100%|█████████▉| 892/896 [08:14<00:01,  3.78it/s]
100%|█████████▉| 893/896 [08:14<00:00,  3.49it/s]
100%|█████████▉| 894/896 [08:18<00:02,  1.17s/it]
100%|█████████▉| 895/896 [08:18<00:00,  1.09it/s]
100%|██████████| 896/896 [08:18<00:00,  1.42it/s]
100%|██████████| 896/896 [08:18<00:00,  1.80it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 224       
Successful requests:                     896       
Benchmark duration (s):                  498.65    
Total input tokens:                      3136000   
Total input text tokens:                 3136000   
Total generated tokens:                  1344000   
Total generated tokens (retokenized):    1342089   
Request throughput (req/s):              1.80      
Input token throughput (tok/s):          6288.93   
Output token throughput (tok/s):         2695.26   
Peak output token throughput (tok/s):    5131.00   
Peak concurrent requests:                242       
Total token throughput (tok/s):          8984.19   
Concurrency:                             205.13    
Accept length:                           2.84      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   114161.37 
Median E2E Latency (ms):                 114002.26 
P90 E2E Latency (ms):                    139627.75 
P95 E2E Latency (ms):                    150296.64 
P99 E2E Latency (ms):                    193496.03 
---------------Time to First Token----------------
Mean TTFT (ms):                          25321.52  
Median TTFT (ms):                        22699.18  
P90 TTFT (ms):                           35430.95  
P95 TTFT (ms):                           38575.97  
P99 TTFT (ms):                           96960.53  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          59.27     
Median TPOT (ms):                        60.15     
P90 TPOT (ms):                           74.75     
P95 TPOT (ms):                           80.85     
P99 TPOT (ms):                           93.53     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           59.27     
Median ITL (ms):                         36.55     
P90 ITL (ms):                            63.00     
P95 ITL (ms):                            69.46     
P99 ITL (ms):                            720.37    
Max ITL (ms):                            32985.48  
==================================================